Revit 2024 API
Outline.GetDiagonalLength Method
 Get the length of outline's diagonal. If called on empty outline, 0. is returned
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double GetDiagonalLength()
Visual Basic
Public Function GetDiagonalLength As Double
Visual C++
public:
double GetDiagonalLength()
Return Value
 The length of the diagonal.
See Also
Outline Class
Autodesk.Revit.DB Namespace